rejeee/hl9-sdk/projects/HL9/IAR/hc32l130f8ua.svd
                <register>
                    <name>PBDIR</name>
                    <description>desc PBDIR</description>
                    <addressOffset>0x140</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0xFFFFFFFF</resetValue>
                    <resetMask>0xFFFF</resetMask>
                    <fields>
                        <field>
                            <name>PB00</name>
                            <description>desc PB00</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PB01</name>
                            <description>desc PB01</description>
                            <msb>1</msb>
                            <lsb>1</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PB03</name>
                            <description>desc PB03</description>
                            <msb>3</msb>
                            <lsb>3</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PB04</name>
                            <description>desc PB04</description>
                            <msb>4</msb>
                            <lsb>4</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PB05</name>
                            <description>desc PB05</description>
                            <msb>5</msb>
                            <lsb>5</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PB06</name>
                            <description>desc PB06</description>
                            <msb>6</msb>
                            <lsb>6</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PB07</name>
                            <description>desc PB07</description>
                            <msb>7</msb>
                            <lsb>7</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PB11</name>
                            <description>desc PB11</description>
                            <msb>11</msb>
                            <lsb>11</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>PBIN</name>
                    <description>desc PBIN</description>
                    <addressOffset>0x144</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFFFF</resetMask>
                    <fields>
                        <field>
                            <name>PB00</name>
                            <description>desc PB00</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>PB01</name>
                            <description>desc PB01</description>
                            <msb>1</msb>
                            <lsb>1</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>PB03</name>
                            <description>desc PB03</description>
                            <msb>3</msb>
                            <lsb>3</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>PB04</name>
                            <description>desc PB04</description>
                            <msb>4</msb>
                            <lsb>4</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>PB05</name>
                            <description>desc PB05</description>
                            <msb>5</msb>
                            <lsb>5</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>PB06</name>
                            <description>desc PB06</description>
                            <msb>6</msb>
                            <lsb>6</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>PB07</name>
                            <description>desc PB07</description>
                            <msb>7</msb>
                            <lsb>7</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>PB11</name>
                            <description>desc PB11</description>
                            <msb>11</msb>
                            <lsb>11</lsb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>PBOUT</name>
                    <description>desc PBOUT</description>
                    <addressOffset>0x148</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0xFFFFFFFF</resetValue>
                    <resetMask>0xFFFF</resetMask>
                    <fields>
                        <field>
                            <name>PB00</name>
                            <description>desc PB00</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PB01</name>
                            <description>desc PB01</description>
                            <msb>1</msb>
                            <lsb>1</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PB03</name>
                            <description>desc PB03</description>
                            <msb>3</msb>
                            <lsb>3</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PB04</name>
                            <description>desc PB04</description>
                            <msb>4</msb>
                            <lsb>4</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PB05</name>
                            <description>desc PB05</description>
                            <msb>5</msb>
                            <lsb>5</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PB06</name>
                            <description>desc PB06</description>
                            <msb>6</msb>
                            <lsb>6</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PB07</name>
                            <description>desc PB07</description>
                            <msb>7</msb>
                            <lsb>7</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PB11</name>
                            <description>desc PB11</description>
                            <msb>11</msb>
                            <lsb>11</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>PBADS</name>
                    <description>desc PBADS</description>
                    <addressOffset>0x14C</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0xFFFFFFFF</resetValue>
                    <resetMask>0xFFFF</resetMask>
                    <fields>
                        <field>
                            <name>PB00</name>
                            <description>desc PB00</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PB01</name>
                            <description>desc PB01</description>
                            <msb>1</msb>
                            <lsb>1</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PB03</name>
                            <description>desc PB03</description>
                            <msb>3</msb>
                            <lsb>3</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PB04</name>
                            <description>desc PB04</description>
                            <msb>4</msb>
                            <lsb>4</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PB05</name>
                            <description>desc PB05</description>
                            <msb>5</msb>
                            <lsb>5</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PB06</name>
                            <description>desc PB06</description>
                            <msb>6</msb>
                            <lsb>6</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PB07</name>
                            <description>desc PB07</description>
                            <msb>7</msb>
                            <lsb>7</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PB11</name>
                            <description>desc PB11</description>
                            <msb>11</msb>
                            <lsb>11</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>PBBSET</name>
                    <description>desc PBBSET</description>
                    <addressOffset>0x150</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0xFFFFFFFF</resetValue>
                    <resetMask>0xFFFF</resetMask>
                    <fields>
                        <field>
                            <name>PB00</name>
                            <description>desc PB00</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PB01</name>
                            <description>desc PB01</description>
                            <msb>1</msb>
                            <lsb>1</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PB03</name>
                            <description>desc PB03</description>
                            <msb>3</msb>
                            <lsb>3</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PB04</name>
                            <description>desc PB04</description>
                            <msb>4</msb>
                            <lsb>4</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PB05</name>
                            <description>desc PB05</description>
                            <msb>5</msb>
                            <lsb>5</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PB06</name>
                            <description>desc PB06</description>
                            <msb>6</msb>
                            <lsb>6</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PB07</name>
                            <description>desc PB07</description>
                            <msb>7</msb>
                            <lsb>7</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PB11</name>
                            <description>desc PB11</description>
                            <msb>11</msb>
                            <lsb>11</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>PBBCLR</name>
                    <description>desc PBBCLR</description>
                    <addressOffset>0x154</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0xFFFFFFFF</resetValue>
                    <resetMask>0xFFFF</resetMask>
                    <fields>
                        <field>
                            <name>PB00</name>
                            <description>desc PB00</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PB01</name>
                            <description>desc PB01</description>
                            <msb>1</msb>
                            <lsb>1</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PB03</name>
                            <description>desc PB03</description>
                            <msb>3</msb>
                            <lsb>3</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PB04</name>
                            <description>desc PB04</description>
                            <msb>4</msb>
                            <lsb>4</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PB05</name>
                            <description>desc PB05</description>
                            <msb>5</msb>
                            <lsb>5</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PB06</name>
                            <description>desc PB06</description>
                            <msb>6</msb>
                            <lsb>6</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PB07</name>
                            <description>desc PB07</description>
                            <msb>7</msb>
                            <lsb>7</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PB11</name>
                            <description>desc PB11</description>
                            <msb>11</msb>
                            <lsb>11</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>PBBSETCLR</name>
                    <description>desc PBBSETCLR</description>
                    <addressOffset>0x158</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>PBBCLR</name>
                            <description>desc PBBCLR</description>
                            <msb>15</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PBBSET</name>
                            <description>desc PBBSET</description>
                            <msb>31</msb>
                            <lsb>16</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>PBDR</name>
                    <description>desc PBDR</description>
                    <addressOffset>0x15C</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0xFFFFFFFF</resetValue>
                    <resetMask>0xFFFF</resetMask>
                    <fields>
                        <field>
                            <name>PB00</name>
                            <description>desc PB00</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PB01</name>
                            <description>desc PB01</description>
                            <msb>1</msb>
                            <lsb>1</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PB03</name>
                            <description>desc PB03</description>
                            <msb>3</msb>
                            <lsb>3</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PB04</name>
                            <description>desc PB04</description>
                            <msb>4</msb>
                            <lsb>4</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PB05</name>
                            <description>desc PB05</description>
                            <msb>5</msb>
                            <lsb>5</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PB06</name>
                            <description>desc PB06</description>
                            <msb>6</msb>
                            <lsb>6</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PB07</name>
                            <description>desc PB07</description>
                            <msb>7</msb>
                            <lsb>7</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PB11</name>
                            <description>desc PB11</description>
                            <msb>11</msb>
                            <lsb>11</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
